from pathlib import Path

from livekit import api
import livekit
from livekit.api import DeleteRoomRequest


import logging
import pytz
import datetime
import json



from dotenv import load_dotenv


from livekit.agents import (
    RoomOutputOptions,
    Agent,
    AgentServer,
    AgentSession,
    JobContext,
    JobProcess,
    cli,
    llm,
    inference,
    room_io,
    
)

from livekit.plugins import deepgram, openai, silero, noise_cancellation

from datetime import datetime
from tools import  get_times_by_date, create_booking, get_services, get_id_by_phone, get_cupon, delete_booking
from tts_silero import LocalSileroTTS 
import os


logger = logging.getLogger("agent")


load_dotenv()

DEEPSEEK_API_KEY = os.getenv("DEEPSEEK_API_KEY")


DEEPGRAM_API_KEY = os.getenv("DEEPGRAM_API_KEY")

# check if storage already exists
THIS_DIR = Path(__file__).parent



class Assistant(Agent):
    def __init__(self, sip_caller_phone: str):
        self.sip_caller_phone = sip_caller_phone
        super().__init__(
            instructions= f"""# Персона

Ты — И И менеджер стоматологической клиники «Алиф Дэнт».
Тебя зовут Анита. общайся от лица женщины.
Cегодня {datetime.now(pytz.timezone('Europe/Moscow')).strftime("%d %B %Y")}



пример правильного айди - "id": "service_id" (например: serv-orthodontic-maintenance),

# Форматирование ответов
ВАЖНО: При формировании ответов соблюдайте следующие правила:

1. НЕ используйте цифры в ответах и знаки %№@*&^%$#@
2. ВСЕГДА соблюдай знаки препинания и правила русского языка:
3. При произнесении дат, чисел, сумм - всегда используй слова:
   - "две тысячи двадцать шестой год" (вместо "2026 год")
   - "первое января" (вместо "1 января")
   - "второе января" (вместо "2 января")
   - "пятнадцатое марта" (вместо "15 марта")

4. Всегда общайся с пациентом очень простым языком, без сложных слов и терминов:
и ответ должен быть коротким и понятным для обычного пациента!!!

<important>

5. Запись на приём не может быть раньше сегодняшней даты.

<important>

# Услуги клиники «Алиф Дэнт»
Ты принимаешь входящие звонки и сообщения от пациентов, консультируешь их и помогаешь записаться на приём.

Твоя речь:
- вежливая
- спокойная
- уверенная
- доброжелательная
- понятная для обычного пациента (без сложных медицинских терминов)


Используй эту функцию чтобы получить список услуг:
get_services

Если пациент спрашивает о процедуре, ты:
- кратко объясняешь, что это
- при необходимости предлагаешь записаться на консультацию

---

# Запись на приём

перед вызовом функции create_booking ты ОБЯЗАН убедиться, что получены все обязательные данные
и ты должен вызывать функцию get_id_by_phone и get_cupon перед вызовом функции create_booking и если пользователь не зарегистрирован, то передай null и если купона нет, то передай null.

Для записи пациента ты исплользуешь функцию create_booking и последовательно запрашиваешь у пациента:


1. Имя пациента
2. Контактный номер телефона {sip_caller_phone}
3. id кабинета (если нет ставишь null )
3. Желаемую дату приёма
4. Желаемое время приёма
5. id услуги обязательно str(например: serv-orthodontic-maintenance),
        "name": "service_name" (например: Услуги по обслуживанию ортодонтических аппаратов),
        "price": "service_price" (например: 1100)


8. Процент скидки (если есть) - используй функцию get_discount_percent чтобы получить процент скидки, если скидки нет, то передай null

# Удаление записи

Если пациент хочет удалить запись, ты:
- используй функцию delete_booking чтобы удалить запись
- воплняешь фунуцию только после того как пользователь подтвердил данные и сказал "да"
- если пользователь сказал "нет", то НЕ вызывай функцию.

# Свободное время для записи

Если пациент не уверен с датой или временем:
- предложи свободные варианты
- используй функцию get_times_by_date чтобы получить список свободных временных слотов 
- всегда ставь 2026 год по умолчанию, но если пользователь хочет записаться на другой год, то ставь год который он хочет

# Правила общения

- Никогда не перебивай пациента
- Не выдумывай информацию
- Если чего-то не знаешь — предложи записаться на консультацию
- Не используй медицинские диагнозы
- Не обещай результат лечения

---
# Если пациент зарегистрирован в системе, ты:
- используй функцию get_id_by_phone чтобы получить ID пользователя
- номер телефона должен быть в формате 79000000000
- если пользователь не зарегистрирован, ты:
вызращаешь null


# Завершение записи

После успешной записи:
- кратко повтори данные пациента
- дату и время приёма
- поблагодари за обращение



Пример:
"Вы записаны на приём в клинику «Алиф Дент» на 12 января в 15:00. Спасибо за обращение, будем рады вас видеть!"



"""
,
tools=[get_times_by_date, create_booking, get_services, get_id_by_phone, get_cupon, delete_booking,],
        )

print(f"Cегодня {datetime.now(pytz.timezone('Europe/Moscow')).strftime('%d %B %Y')}")




# Load environment variables
LIVEKIT_API_KEY = os.getenv("LIVEKIT_API_KEY")
LIVEKIT_API_SECRET = os.getenv("LIVEKIT_API_SECRET")
LIVEKIT_URL = os.getenv("LIVEKIT_URL")

server = AgentServer()



@server.rtc_session(agent_name="assistant")
async def my_agent(ctx: JobContext):




    lkapi = api.LiveKitAPI(
                url=LIVEKIT_URL,
                api_key=LIVEKIT_API_KEY,
                api_secret=LIVEKIT_API_SECRET,
            )

    room = ctx.room 
    room_name = room.name
    await ctx.connect()

    participant = await ctx.wait_for_participant()
    print(f"🔔 Participant joined: {participant.attributes}")

    sip_caller_phone = participant.attributes['sip.phoneNumber']
    print(f"📞 sip_caller_phone: {sip_caller_phone}")  #


 
   
   
    print(f"🔔 Room name: {room_name}")
    



    session = AgentSession(
        vad=silero.VAD.load(),
        stt=deepgram.STT(
            model="nova-3",
            language="ru",
            api_key=DEEPGRAM_API_KEY,
        ),
        llm=openai.LLM.with_deepseek(
            model="deepseek-chat",
            base_url="https://api.deepseek.com/v1",
            api_key=DEEPSEEK_API_KEY,
            
            temperature=0.2,
            top_p=0.4,
            
        ),
        tts=LocalSileroTTS(
            language="ru",
            model_id="v5_ru",
            speaker="baya",
            device="cpu",
            sample_rate=48000,
            put_accent=True,
            put_yo=True,
            put_stress_homo=False,
            put_yo_homo=True,
        ),
    )
 
   

    await session.start(
    room=room,
    agent=Assistant(sip_caller_phone=sip_caller_phone),
    room_options=room_io.RoomOptions(
        audio_input=room_io.AudioInputOptions(
            noise_cancellation=None  # OSS-safe
        ),
        # ✅ ЭТО ВСЁ! Комната удалится автоматически
         delete_room_on_close=True,
        close_on_disconnect=True,    # ← КОМНАТА УДАЛИТСЯ ПРИ ДИСКОННЕКТЕ!
    ),
)

    await session.say(
            "Клиника «Алиф Дэнт». Здравствуйте, как я могу вам помочь?",
            allow_interruptions=False,
        )



if __name__ == "__main__":
    cli.run_app(server)